app/controllers/account_plans_controller.rb

SELECT * FROM (SELECT TOP 0 * FROM (SELECT TOP 0 * FROM [DIM_AccountPlan] WHERE (Account_ID = NULL) ORDER BY Record_Creation_Date DESC) AS tmp1 ORDER BY Record_Creation_Date ASC) AS tmp2 ORDER BY Record_Creation_Date DESC
SELECT count(*) as TotalRows from (SELECT TOP 1000000000 * FROM [DIM_AccountPlan] ORDER BY Record_Creation_Date DESC) tally
---
  def index
    # @account_plans = AccountPlan.find(:all)

    @account_plans = AccountPlan.paginate(:page => params[:page],
    #:conditions => ["Account_ID = ?", params[:search]],
     :order => 'Record_Creation_Date DESC')

INSERT INTO [DIM_AccountPlan] ([Account_Short_Description], [Account_Parent_ID], [Account_UO], [Account_ID], [Record_Creation_Date], [Parent_ID], [Record_Modifier], [Account_Type_FK], [Lock_Status], [Sequence_ID], [Record_Modification_Date], [Record_Creator], [Group_Identifier], [Entity_Identifier], [Account_Description]) VALUES('test', '', '+', '10000000', '20081231 00:00:00', NULL, NULL, 3, 0, 23, NULL, 'suser_sname + - + user_name', 'Hapoalim Switzerland Ltd.', 'Zurich', 'test')
---
  def create
    @account_plan = AccountPlan.new(params[:account_plan])

    respond_to do |format|
      if @account_plan.save

SELECT TOP 1 [DIM_AccountPlan].FiMIS_Identifier FROM [DIM_AccountPlan] WHERE ([DIM_AccountPlan].[Account_ID] COLLATE Latin1_General_CS_AS = '001018000C' AND [DIM_AccountPlan].Account_Type_FK = 4 AND [DIM_AccountPlan].FiMIS_Identifier <> 3346)
UPDATE [DIM_AccountPlan] SET [Lock_Status] = 1, [Record_Creation_Date] = '20081006 18:54:46', [Account_Description] = 'Balance sheet 2 ', [Account_Short_Description] = 'Balance sheet 2 ', [Account_Parent_ID] = '', [Sequence_ID] = 5 WHERE [FiMIS_Identifier] = 1
---
  def update
    @account_plan = AccountPlan.find(params[:id])

    respond_to do |format|
      if @account_plan.update_attributes(params[:account_plan])