app/controllers/b2_ta_mappings_controller.rb

  def show
    @b2_ta_mappings = B2TaMapping.find(params[:id])
---
SELECT * FROM [b2_ta_mapping] WHERE ([b2_ta_mapping].[id] = 26)

  def edit
    @b2_ta_mappings = B2TaMapping.find(params[:id])
---
SELECT * FROM [b2_ta_mapping] WHERE ([b2_ta_mapping].[id] = 26)