app/controllers/client_security_positions_controller.rb

  def index
    # @client_security_positions = ClientSecurityPosition.paginate(:page => params[:page], :order => 'Load_Date DESC')

    @client_security_positions = ClientSecurityPosition.paginate(:page => params[:page], :conditions => ["client_identifier = ?", params[:search]], :order => 'Load_Date DESC')
---
SELECT * FROM (SELECT TOP 0 * FROM (SELECT TOP 0 * FROM [SRC_ClientSecurityPositions] WHERE (client_identifier = NULL) ORDER BY Load_Date DESC) AS tmp1 ORDER BY [Load_Date] ASC) AS tmp2 ORDER BY [Load_Date] DESC
SELECT count(*) as TotalRows from (SELECT TOP 1000000000 * FROM [SRC_ClientSecurityPositions] WHERE (client_identifier = NULL) ORDER BY Load_Date DESC) tally

  def show
    @client_security_position = ClientSecurityPosition.find(params[:id])
---
SELECT * FROM [SRC_ClientSecurityPositions] WHERE ([SRC_ClientSecurityPositions].[id] = 132151)

  def edit
    @client_security_position = ClientSecurityPosition.find(params[:id])
---
SELECT * FROM [SRC_ClientSecurityPositions] WHERE ([SRC_ClientSecurityPositions].[id] = 133083)