app/controllers/closing_rates_controller.rb

  def show
    @closing_rate = ClosingRate.find(params[:id])
---
SELECT * FROM [B2TA_ClosingRates] WHERE ([B2TA_ClosingRates].[id] = 265)

  def edit
    @closing_rate = ClosingRate.find(params[:id])
---
SELECT * FROM [B2TA_ClosingRates] WHERE ([B2TA_ClosingRates].[id] = 267)

  def create
    @closing_rate = ClosingRate.new(params[:closing_rate])

    respond_to do |format|
      if @closing_rate.save
---
INSERT INTO [B2TA_ClosingRates] ([Downloaddate], [Entity_id], [Updated_at], [Currency_Rate], [Created_by], [Updated_with], [Record_Validity], [Currency_Code], [Currency_ISO], [Updated_by], [Created_with], [Group_id], [Created_at]) VALUES('20081231 00:00:00', 'Zurich', NULL, 1.32, NULL, NULL, NULL, '352', 'JPY', NULL, NULL, 'Hapoalim Switzerla1', NULL)

  def update
    @closing_rate = ClosingRate.find(params[:id])

    respond_to do |format|
      if @closing_rate.update_attributes(params[:closing_rate])
---
SELECT * FROM [B2TA_ClosingRates] WHERE ([B2TA_ClosingRates].[id] = 267)
UPDATE [B2TA_ClosingRates] SET [Currency_ISO] = 'CHF', [Downloaddate] = '20081231 00:00:00', [Currency_Code] = '356' WHERE [id] = 267

  def destroy
    @closing_rate = ClosingRate.find(params[:id])
    @closing_rate.destroy
---
SELECT * FROM [B2TA_ClosingRates] WHERE ([B2TA_ClosingRates].[id] = 265)
DELETE FROM [B2TA_ClosingRates] WHERE [id] = 265