app/controllers/currencies_controller.rb

SELECT * FROM [DIM_Currency]
---
  def index

  	@search = Currency.search(params[:search])