app/controllers/fdbtabs_controller.rb

SELECT * FROM [fdbtabs]
---
  def index

    @search = Fdbtab.search(params[:search])