app/controllers/homes_controller.rb

  def index

    @homes = Home.all
---
SELECT * FROM (SELECT TOP 3 * FROM (SELECT TOP 3 * FROM [homes] ) AS tmp1) AS tmp2

  def show
    @home = Home.find(params[:id])
---
SELECT * FROM [homes] WHERE ([homes].[id] = 1)