app/controllers/passwords_controller.rb

SELECT * FROM [passwords]
---
  def index
    @passwords = Password.all