app/controllers/report_lines_controller.rb

SELECT * FROM [DIM_ReportLines] WHERE (report_id = '25') ORDER BY [position] ASC
---
  def index

    if params[:report_id].nil?
      @report_lines = ReportLine.find(:all,:order => "position ASC")