app/controllers/reports_controller.rb

SELECT * FROM [DIM_Reports] WHERE (report_category_id = '2') ORDER BY [Order] ASC
---
  def index
      if params[:report_category_id].nil?
      @reports = Report.find(:all,:order => "[Order] ASC")