app/controllers/report_categories_controller.rb

  def show
    @report_category = ReportCategory.find(params[:id])
---
SELECT * FROM [DIM_Report_Categories] WHERE ([DIM_Report_Categories].[Report_Category_ID] = 1)

  def edit
    @report_category = ReportCategory.find(params[:id])
---
SELECT * FROM [DIM_Report_Categories] WHERE ([DIM_Report_Categories].[Report_Category_ID] = 1)

  def update
    @report_category = ReportCategory.find(params[:id])

    respond_to do |format|
      if @report_category.update_attributes(params[:report_category])
---
SELECT * FROM [DIM_Report_Categories] WHERE ([DIM_Report_Categories].[Report_Category_ID] = 1)
UPDATE [DIM_Report_Categories] SET [Category_Type_Description] = 'Swiss GAAP 2' WHERE [Report_Category_ID] = 1