app/controllers/reports_controller.rb

  def index

    @search = Report.search(params[:search])
---
SELECT * FROM [DIM_Reports] ORDER BY DIM_Reports.Report_Category_ID DESC

  def destroy
    @report = Report.find(params[:id])
    @report.destroy
---
SELECT * FROM [DIM_Reports] WHERE ([DIM_Reports].[Report_ID] = 2)
DELETE FROM [DIM_Reports] WHERE [Report_ID] = 2