app/controllers/scenarios_controller.rb

  def update
    @scenario = Scenario.find(params[:id])

    respond_to do |format|
      if @scenario.update_attributes(params[:scenario])
---
UPDATE [DIM_Scenario] SET [Category_Name] = 'Actual 2' WHERE [Fimis_Identifier] = 1