app/controllers/structures_controller.rb

INSERT INTO [DIM_Structure] ([Group_Identifier], [Entity_Identifier], [Division_Identifier], [Division_Description]) VALUES('Hapoalim Switzerland Ltd.', 'Singapore', '0000080', 'test')
---
  def create
    @structure = Structure.new(params[:structure])

    respond_to do |format|
      if @structure.save

UPDATE [DIM_Structure] SET [Division_Description] = 'Head-Office 1' WHERE [Fimis_Identifier] = 1
---
  def update
    @structure = Structure.find(params[:id])

    respond_to do |format|
      if @structure.update_attributes(params[:structure])