app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])

    success = @user && @user.save
---
INSERT INTO [users] ([name], [salt], [updated_at], [crypted_password], [remember_token_expires_at], [remember_token], [login], [email], [created_at]) VALUES('', '204f170c9e974c89b6e44a18a48326e576a63fda', '2009-06-16 21:32:36.343', 'b9da2c30058564d119c5db70ca0a368ddf44f832', NULL, NULL, 'test', 'test@test.com', '2009-06-16 21:32:36.343')