app/controllers/validations_controller.rb

  def index

    @search = Validation.search(params[:search])
---
SELECT * FROM [validations]

  def show
    @validation = Validation.find(params[:id])
---
SELECT * FROM [validations] WHERE ([validations].[id] = 3)

  def edit
    @validation = Validation.find(params[:id])
---
SELECT * FROM [validations] WHERE ([validations].[id] = 3)

  def update
    @validation = Validation.find(params[:id])

    respond_to do |format|
      if @validation.update_attributes(params[:validation])
---
SELECT * FROM [validations] WHERE ([validations].[id] = 3)
UPDATE [validations] SET [updated_at] = '2009-10-08 07:22:57.984', [created_at] = '2009-10-08 09:11:00.000', [Key_id] = 'test 2' WHERE [id] = 3